# Filter Numeric Equals Methods

Source: https://www.revitapidocs.com/2026/88372c9c-83e0-11a3-d738-852fa47f034c.htm

---

| Filter Numeric Equals Methods |
| --- |

The FilterNumericEquals type exposes the following members.

Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from FilterNumericRuleEvaluator ) |
|  | Equals | Determines whether the specified object is equal to the current object. (Inherited from Object ) |
|  | Evaluate(Int64, Int64\) | Derived classes should override this method to implement the desired test. (Inherited from FilterNumericRuleEvaluator ) |
|  | Evaluate(Double, Double, Double) | Derived classes override this method to implement the test that determines  whether the two given double\-precision values satisfy the desired condition or not. (Inherited from FilterNumericRuleEvaluator ) |
|  | GetHashCode | Serves as the default hash function. (Inherited from Object ) |
|  | GetType | Gets the Type of the current instance. (Inherited from Object ) |
|  | ToString | Returns a string that represents the current object. (Inherited from Object ) |

Top See Also

#### Reference

FilterNumericEquals Class Autodesk.Revit.DB Namespace